app/views/comments/_comment.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---

<%@post = Post.find(params[:post_id]) %>
Posted by <%= User.find(@post.user_id).f_name + User.find(@post.user_id).l_name %> <br>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]
---
     <%#end%>
 <b>Comment &nbsp; &nbsp;   <%= @post.comments.count %></b>