app/controllers/comments_controller.rb

  def new

    @comments = @post.comments.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]

  def create
       @comment = @post.comments.create(find_params)
  	   @comment.user_id = current_user.id

  	   if @comment.save!
---
INSERT INTO "comments" ("desc", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["desc", "g"], ["post_id", 3], ["created_at", "2016-03-31 07:10:08.406713"], ["updated_at", "2016-03-31 07:10:08.406713"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 4], ["updated_at", "2016-03-31 07:12:29.225405"], ["id", 2]]

  def edit
      @comments = @post.comments.all
      @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", nil]]

  def update
        @comment = Comment.find(params[:id])
        @comment.update(find_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "comments" SET "desc" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["desc", "hi....comeented by vineet.............hmmm"], ["updated_at", "2016-04-01 10:49:01.290437"], ["id", 3]]

  def like
        @post = Post.find(params[:post_id])
        @comment = @post.comments.find(params[:id])

        if current_user.already_dislikes?(@comment,'Comment')
           like = current_user.likes.where(likeble_id: @comment.id ,
           user_id: current_user.id ,likeble_type: 'Comment').first
           like.like_status = true
           like.save
           redirect_to  new_post_comments_path(@post)

         else
           if current_user.already_likes?(@comment ,'Comment')
              redirect_to  new_post_comments_path(@post)
           else
              like = @comment.likes.create()
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 14], ["id", 15]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."likeble_id" = ? AND "likes"."user_id" = ? AND "likes"."likeble_type" = ?  ORDER BY "likes"."id" ASC LIMIT 1  [["user_id", 15], ["likeble_id", 31], ["user_id", 15], ["likeble_type", "Comment"]]
UPDATE "likes" SET "user_id" = ?, "like_status" = ?, "updated_at" = ? WHERE "likes"."id" = ?  [["user_id", 15], ["like_status", "t"], ["updated_at", "2016-04-02 06:36:54.613263"], ["id", 61]]
INSERT INTO "likes" ("likeble_id", "likeble_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["likeble_id", 3], ["likeble_type", "Comment"], ["created_at", "2016-04-01 07:19:08.823054"], ["updated_at", "2016-04-01 07:19:08.823054"]]

  def dislike
        @post = Post.find(params[:post_id])
        @comment = @post.comments.find(params[:id])


        if current_user.already_likes?(@comment,'Comment')
           like = current_user.likes.where(likeble_id: @comment.id ,
           user_id: current_user.id,likeble_type: 'Comment').first
           like.like_status = false
           like.save
           redirect_to  new_post_comments_path(@post)

        else
          if current_user.already_dislikes?(@comment ,'Comment')
             redirect_to  new_post_comments_path(@post)
          else
             like = @comment.likes.create()
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 13]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 13], ["id", 32]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."likeble_id" = ? AND "likes"."user_id" = ? AND "likes"."likeble_type" = ?  ORDER BY "likes"."id" ASC LIMIT 1  [["user_id", 15], ["likeble_id", 34], ["user_id", 15], ["likeble_type", "Comment"]]
UPDATE "likes" SET "user_id" = ?, "like_status" = ?, "updated_at" = ? WHERE "likes"."id" = ?  [["user_id", 15], ["like_status", "t"], ["updated_at", "2016-04-02 07:02:35.363166"], ["id", 71]]
INSERT INTO "likes" ("likeble_id", "likeble_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["likeble_id", 33], ["likeble_type", "Comment"], ["created_at", "2016-04-02 07:02:35.271600"], ["updated_at", "2016-04-02 07:02:35.271600"]]