app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "postyfg676"], ["body", "thjkrfgejhejhrsjehfgdjbnxbvhbvesngbe"], ["user_id", 4], ["created_at", "2016-03-30 07:17:31.942643"], ["updated_at", "2016-03-30 07:17:31.942643"]]
---
  def create


  	   @post = current_user.posts.create(find_params)

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "this is my new post"], ["updated_at", "2016-03-28 19:10:54.810793"], ["id", 1]]
---
  def update
        @post.update(find_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."likeble_id" = ? AND "likes"."user_id" = ? AND "likes"."likeble_type" = ?  ORDER BY "likes"."id" ASC LIMIT 1  [["user_id", 4], ["likeble_id", 18], ["user_id", 4], ["likeble_type", "Post"]]
UPDATE "likes" SET "user_id" = ?, "like_status" = ?, "updated_at" = ? WHERE "likes"."id" = ?  [["user_id", 4], ["like_status", "t"], ["updated_at", "2016-04-02 01:40:19.141628"], ["id", 51]]
INSERT INTO "likes" ("likeble_id", "likeble_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["likeble_id", 3], ["likeble_type", "Post"], ["created_at", "2016-04-01 07:59:57.643911"], ["updated_at", "2016-04-01 07:59:57.643911"]]
---
  def like
      @post = Post.find(params[:post_id])


    if current_user.already_dislikes?(@post ,'Post')
       like = current_user.likes.where(likeble_id: @post.id ,
       user_id: current_user.id ,likeble_type: 'Post' ).first
       like.like_status = true
       like.save
       redirect_to root_path

     else
        if current_user.already_likes?(@post ,'Post')
           redirect_to root_path
        else
           like = @post.likes.create

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."likeble_id" = ? AND "likes"."user_id" = ? AND "likes"."likeble_type" = ?  ORDER BY "likes"."id" ASC LIMIT 1  [["user_id", 4], ["likeble_id", 19], ["user_id", 4], ["likeble_type", "Post"]]
UPDATE "likes" SET "user_id" = ?, "like_status" = ?, "updated_at" = ? WHERE "likes"."id" = ?  [["user_id", 15], ["like_status", "f"], ["updated_at", "2016-04-02 06:20:27.109154"], ["id", 57]]
INSERT INTO "likes" ("likeble_id", "likeble_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["likeble_id", 6], ["likeble_type", "Post"], ["created_at", "2016-04-02 02:04:38.979671"], ["updated_at", "2016-04-02 02:04:38.979671"]]
---
  def dislike
      @post = Post.find(params[:post_id])

    if current_user.already_likes?(@post ,'Post')
       like = current_user.likes.where(likeble_id: @post.id ,
       user_id: current_user.id ,likeble_type: 'Post' ).first
       like.like_status = false
       like.save
       redirect_to root_path

     else
        if current_user.already_dislikes?(@post ,'Post')
           redirect_to root_path
        else
           like = @post.likes.create